
require "kconv"


puts "Hello World"
puts Kconv.tosjis("ほげほげ")


# **********  変数     *************************
VAR  = "定数"                 # 大文字で始まる
$var = "グローバル変数"       # '$' で始まる

def func
  var = "ローカル変数"        # 小文字で始まる
end

class Class
  @@var = "クラス変数"        # '@@' で始まる
  def initialize
    @var = "インスタンス変数" # '@' で始まる
  end
end

# **********  演算子     *************************
a    = 100                                      # 代入
a, b = 10, 20                                   # 多重代入
a = (1 + 2) / (3 - 4) * 5                       # 四則演算
a = (1 && 2) and (3 || 4) or !(5)               # 論理演算
a = 7 % 2                                       # 剰余
a = 3 ** 0.5                                    # 累乗（この場合√3）
a = (1 == 2) or (3 != 4) or (5 < 6) or (7 <= 8) # 比較演算